Revit 2026 API

# VerticalTextAlignment Enumeration

---

Supported types of vertical alignment of a text element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum VerticalTextAlignment
```
```vb
Public Enumeration VerticalTextAlignment
```
```cpp
public enum class VerticalTextAlignment
```
```fsharp
type VerticalTextAlignment
```

| Member name | Value | Description |
| --- | --- | --- |
| Bottom | 1 | Bottom of the text box remains in place as the height of the text changes. |
| Middle | 2 | The horizontal center line of the text box remains in place as the height of the text changes. |
| Top | 0 | Top of the text box remains in place as the height of the text changes. |

#### Reference

Autodesk.Revit.DB Namespace